taskt/Core/Automation/Commands/ExcelGroup/IExcelCellValueTypeProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IExcelCellValueTypeProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IExcelCellActionProperties" [ label="IExcelCellActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelCellValueTypeProperties" [ label="IExcelCellValueTypeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AExcelCellActionCommands" [ label="AExcelCellActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ExcelCheckCellValueExistsCommand" [ label="ExcelCheckCellValueExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelGetCellCommand" [ label="ExcelGetCellCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelSetCellCommand" [ label="ExcelSetCellCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.IExcelCellActionProperties" -> "taskt.Core.Automation.Commands.IExcelCellValueTypeProperties";
"taskt.Core.Automation.Commands.AExcelCellActionCommands" -> "taskt.Core.Automation.Commands.IExcelCellActionProperties";
"taskt.Core.Automation.Commands.ExcelCheckCellValueExistsCommand" -> "taskt.Core.Automation.Commands.AExcelCellActionCommands";
"taskt.Core.Automation.Commands.ExcelGetCellCommand" -> "taskt.Core.Automation.Commands.AExcelCellActionCommands";
"taskt.Core.Automation.Commands.ExcelSetCellCommand" -> "taskt.Core.Automation.Commands.AExcelCellActionCommands";
}
